# Используем официальный образ Node.js как базовый образ
FROM node:18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем зависимости вашего проекта в контейнер
COPY package*.json ./

# Устанавливаем зависимости вашего проекта
RUN npm install

# Копируем файлы вашего проекта в контейнер
COPY . .

# Определяем переменную окружения
ENV NODE_ENV production

# Открываем порт, на котором будет работать ваше приложение
EXPOSE 3000

# Запускаем ваше приложение
CMD ["node", "index.js"]